---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleShowOpeningHt
source: html/957882ab-6f75-c3ba-be9f-4b00f223aee1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleShowOpeningHt Property

"Show Opening Height"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleShowOpeningHt { get; }
```